{
  "success": true,
  "data": [
    {
      "_id": "683f5556d7fcf87af76d637d",
      "title": "WMS QVC-Zulily - Lead Consultant",
      "description": "The WMS stands for Warehouse Management System. It consists of two environments Zulily (corp.zulily.com) and QHX (qvc.zulily.net). The project consisted of various modules based on the operations and the place in the Warehouse this operation performed.",
      "shortDescription": "Warehouse Management System with micro-frontend architecture for QVC-Zulily operations",
      "technologies": [
        "ReactJs",
        "Redux",
        "Java",
        "Spring Boot",
        "MySQL",
        "Redis",
        "RabbitMQ",
        "Node.js",
        "MongoDB"
      ],
      "category": "web",
      "status": "completed",
      "priority": "high",
      "startDate": "2021-09-01T00:00:00.000Z",
      "endDate": "2024-01-01T00:00:00.000Z",
      "demoUrl": "",
      "githubUrl": "",
      "images": [
        "https://images.unsplash.com/photo-1586953208448-b95a79798f07?w=600&h=400&fit=crop"
      ],
      "features": [
        "Working as Lead Consultant, coordinating with the team for technical discussions",
        "Developed backend APIs using Java Spring boot with test cases",
        "Worked on front-end using ReactJs with micro-front-end architecture",
        "Created reusable components and modified existing frameworks",
        "Used Datadog, Kibana for tracing logs and issues",
        "Worked with MySql, Redis, RabbitMQ for backend implementations"
      ],
      "challenges": "Managing micro-frontend architecture and coordinating with multiple teams",
      "learnings": "Gained expertise in warehouse management systems and micro-frontend patterns",
      "teamSize": 8,
      "role": "Lead Consultant",
      "isPublic": true,
      "isFeatured": true,
      "viewCount": 0,
      "likes": 0,
      "tags": [
        "reactjs",
        "redux",
        "java",
        "spring-boot",
        "mysql",
        "microservices"
      ],
      "createdAt": "2025-06-03T20:04:38.407Z",
      "updatedAt": "2025-06-03T20:04:38.407Z",
      "__v": 0
    },
    {
      "_id": "683f584ad7fcf87af76d63da",
      "title": "OVERSIGHT - Senior Software Engineer",
      "description": "Oversight's platform works on customers' financial systems to continuously monitor and analyze all spend transactions for fraud, waste, and misuse. With a consolidated, consistent view of risk across their enterprise, customers can prevent financial loss and optimize spend while strengthening the controls that improve compliance.\n\nCompany: Xpanxion UST Global\nLocation: Pune, India",
      "shortDescription": "Financial monitoring platform that continuously analyzes spend transactions for fraud, waste, and misuse prevention",
      "technologies": [
        "Java",
        "Spring Boot",
        "Angular 7",
        "HTML5",
        "CSS3",
        "JavaScript",
        "Prime-Ng",
        "Angular Material",
        "SQL"
      ],
      "category": "web",
      "status": "completed",
      "priority": "high",
      "startDate": "2019-06-01T00:00:00.000Z",
      "endDate": "2021-09-01T00:00:00.000Z",
      "demoUrl": "",
      "githubUrl": "",
      "images": [
        "https://images.unsplash.com/photo-1551288049-bebda4e38f71?w=600&h=400&fit=crop"
      ],
      "features": [
        "Working as Senior Software Engineer, coordinating with the team for designing Mock-ups, developing Rest APIs",
        "Developed backend APIs using Spring boot, java and testing it using postman integrating it with front end",
        "Analyze requirements, communicate, and resolve issues and assign tasks and monitor the progress of assigned tasks",
        "Coordinate with clients on status, technical discussions, issues and features. perform design, code reviews and enforce related standards",
        "Assist team members in technical issues, mentor team members as they grow in their career",
        "Creating jenkins Jobs, checking for build failure and fixing it, POCs for complex functionality",
        "Worked on different sub projects, like portal, workbench, OCR"
      ],
      "challenges": "Managing multiple sub-projects while ensuring continuous monitoring accuracy and preventing false positives in fraud detection",
      "learnings": "Gained expertise in financial fraud detection systems, team leadership, and enterprise-level transaction monitoring",
      "teamSize": 6,
      "role": "Senior Software Engineer",
      "isPublic": true,
      "isFeatured": true,
      "viewCount": 0,
      "likes": 0,
      "tags": [
        "java",
        "spring-boot",
        "angular",
        "financial-systems",
        "fraud-detection",
        "enterprise"
      ],
      "createdAt": "2025-06-03T20:17:14.366Z",
      "updatedAt": "2025-06-03T20:17:14.366Z",
      "__v": 0
    },
    {
      "_id": "683f58afd7fcf87af76d63e5",
      "title": "AFS-UPL - Software Engineer",
      "description": "The concept of Adarsh Farm Services was conceived by UPL Ltd with the objective of providing best farm mechanization technology and services, leading to a transformation in farming through better efficiency, better yields and building direct relationships with the farming community.\n\nCompany: Tudip Technologies\nLocation: Pune, India",
      "shortDescription": "Farm mechanization platform ensuring 50% cost saving for farmers and 10-20% yield increase through advanced agricultural technology services",
      "technologies": [
        "Angular 6",
        "HTML5",
        "CSS3",
        "JavaScript",
        "jQuery",
        "Google Map APIs",
        "Google Earth Engine",
        "Oracle 10G",
        "SQL",
        "Java",
        "Spring Boot"
      ],
      "category": "web",
      "status": "completed",
      "priority": "high",
      "startDate": "2018-01-01T00:00:00.000Z",
      "endDate": "2019-06-01T00:00:00.000Z",
      "demoUrl": "",
      "githubUrl": "",
      "images": [
        "https://images.unsplash.com/photo-1574943320219-553eb213f72d?w=600&h=400&fit=crop"
      ],
      "features": [
        "Multi-skilling team member responsible for UI design and development with REST API integration",
        "Analysis of real time field issues and providing optimal solutions",
        "Client interaction for technical discussions, problem-solving and feasible solution suggestions",
        "Complete ownership of UI designs and development from scratch",
        "Implemented functional flows, Android app designs and support for web-based and mobile applications",
        "Field visits to different states to interact with BDO, FO and Operators for requirement gathering",
        "Complete design and development of MDM (Master data management) portal",
        "Daily scrum calls, client meetings, project demos, and multi-environment deployments"
      ],
      "challenges": "Managing real-time field issues across different states while ensuring seamless integration between web and mobile platforms for diverse agricultural stakeholders",
      "learnings": "Gained expertise in agricultural technology solutions, Google Earth Engine integration, and cross-platform development for farming communities",
      "teamSize": 5,
      "role": "Software Engineer",
      "isPublic": true,
      "isFeatured": true,
      "viewCount": 0,
      "likes": 0,
      "tags": [
        "angular",
        "java",
        "spring-boot",
        "agriculture",
        "google-maps",
        "google-earth-engine",
        "oracle",
        "farming-technology"
      ],
      "createdAt": "2025-06-03T20:18:55.868Z",
      "updatedAt": "2025-06-03T20:18:55.868Z",
      "__v": 0
    },
    {
      "_id": "683f58fcd7fcf87af76d63f0",
      "title": "Speak 'N Cook",
      "description": "A voice-controlled cooking assistant app that helps users search and cook recipes through voice commands step by step. Features dual roles for Admin and End Users.\n\nCompany: Tudip Technologies\nLocation: Pune, India",
      "shortDescription": "Voice-controlled cooking assistant app enabling hands-free recipe cooking with voice commands like Read, Next, Pause, Resume, and Repeat",
      "technologies": [
        "React Native",
        "Voice Recognition",
        "iOS Development",
        "Web Admin Portal",
        "REST APIs"
      ],
      "category": "mobile",
      "status": "completed",
      "priority": "medium",
      "startDate": "2017-06-01T00:00:00.000Z",
      "endDate": "2018-12-31T00:00:00.000Z",
      "demoUrl": "https://itunes.apple.com/us/app/speak-n-cook/id1354367604?ls=1&mt=8",
      "githubUrl": "",
      "images": [
        "/assets/img/speekncook-1.png"
      ],
      "features": [
        "Implemented voice command functionality using React Native packages for recipe step navigation",
        "Developed recipe management system with image upload capabilities for both users and admins",
        "Created admin portal for recipe moderation, user management, and analytics",
        "Built cuisine management system with detailed descriptions",
        "Integrated iOS app store deployment pipeline",
        "Voice commands: Read, Next, Pause, Resume, and Repeat functionality",
        "Dual role system for Admin and End Users"
      ],
      "challenges": "Implementing accurate voice recognition in kitchen environments with background noise and ensuring seamless hands-free navigation",
      "learnings": "Gained expertise in voice recognition technology, React Native development, and iOS app store deployment processes",
      "teamSize": 3,
      "role": "Mobile Developer",
      "isPublic": true,
      "isFeatured": false,
      "viewCount": 0,
      "likes": 0,
      "tags": [
        "react-native",
        "voice-recognition",
        "ios",
        "cooking-app",
        "mobile-development",
        "app-store"
      ],
      "createdAt": "2025-06-03T20:20:12.461Z",
      "updatedAt": "2025-06-03T20:20:12.461Z",
      "__v": 0
    },
    {
      "_id": "683f593fd7fcf87af76d63fe",
      "title": "Geo-Localization - Intern Software Engineer",
      "description": "The Geo-Localization project is created to keep the track of ships moving across the globe. It includes tracking the locations of ships showing its details. The ArcGIS server is used to keep the data for locations like longitude, latitude and some other details.\n\nCompany: MAN Diesel & Turbo India Pvt.Ltd.\nLocation: Aurangabad, India",
      "shortDescription": "Ship tracking system using Google Maps SDK and ArcGIS server to monitor global vessel movements with advanced filtering capabilities",
      "technologies": [
        "C# .Net",
        "Google Map API",
        "Javascript",
        "MySQL",
        "ArcGIS",
        "Bootstrap",
        "HTML",
        "CSS"
      ],
      "category": "web",
      "status": "completed",
      "priority": "medium",
      "startDate": "2017-01-01T00:00:00.000Z",
      "endDate": "2016-06-30T00:00:00.000Z",
      "demoUrl": "",
      "githubUrl": "",
      "images": [
        "https://images.unsplash.com/photo-1578662996442-48f60103fc96?w=600&h=400&fit=crop"
      ],
      "features": [
        "Global ship tracking system to monitor vessel movements across the globe",
        "ArcGIS server integration for storing location data including longitude, latitude and vessel details",
        "Responsive UI development using Bootstrap, HTML, CSS and media queries",
        "Google Maps SDK implementation for real-time ship location visualization",
        "Advanced filtering system based on Ship Type, Date, and Engine Capacity",
        "Real-time location tracking with detailed ship information display",
        "Geographic data management and visualization capabilities"
      ],
      "challenges": "Integrating ArcGIS server with Google Maps API while ensuring real-time tracking accuracy and implementing complex filtering mechanisms for large datasets",
      "learnings": "Gained expertise in GIS technologies, real-time tracking systems, Google Maps API integration, and maritime industry requirements",
      "teamSize": 2,
      "role": "Intern Software Engineer",
      "isPublic": true,
      "isFeatured": false,
      "viewCount": 0,
      "likes": 0,
      "tags": [
        "csharp",
        "dotnet",
        "google-maps",
        "arcgis",
        "ship-tracking",
        "geolocation",
        "mysql",
        "maritime"
      ],
      "createdAt": "2025-06-03T20:21:19.865Z",
      "updatedAt": "2025-06-03T20:21:19.865Z",
      "__v": 0
    },
    {
      "_id": "683f5904d7fcf87af76d63f3",
      "title": "npm Enterprise",
      "description": "A private npm registry solution enabling large teams to share, discover, and reuse code behind corporate firewalls. Built on the same codebase that powers the public npm registry.\n\nCompany: Tudip Technologies\nLocation: Pune, India",
      "shortDescription": "Enterprise-grade private npm registry with authentication, private module sharing, and streamlined development workflows for large organizations",
      "technologies": [
        "Node.js",
        "Docker",
        "Shell Scripting",
        "Replicated",
        "npm CLI"
      ],
      "category": "tool",
      "status": "completed",
      "priority": "high",
      "startDate": "2016-08-01T00:00:00.000Z",
      "endDate": "2016-12-31T00:00:00.000Z",
      "demoUrl": "",
      "githubUrl": "",
      "images": [
        "/assets/img/npm_e.png"
      ],
      "features": [
        "Developed Docker-based deployment architecture for npmE appliance",
        "Implemented various authentication methods for enterprise security",
        "Created internal sharing system for private modules",
        "Built development and deployment workflow controls",
        "Enhanced code discovery and sharing capabilities within organizations",
        "Enterprise authentication integration",
        "Private module management",
        "Corporate firewall compatibility",
        "Docker containers with Replicated orchestration"
      ],
      "challenges": "Ensuring enterprise-level security while maintaining npm registry performance and implementing seamless authentication across different corporate systems",
      "learnings": "Gained expertise in enterprise software architecture, Docker containerization, private registry management, and corporate security requirements",
      "teamSize": 5,
      "role": "Backend Developer",
      "isPublic": true,
      "isFeatured": true,
      "viewCount": 0,
      "likes": 0,
      "tags": [
        "nodejs",
        "docker",
        "npm",
        "enterprise",
        "private-registry",
        "containerization",
        "devops"
      ],
      "createdAt": "2025-06-03T20:20:20.839Z",
      "updatedAt": "2025-06-03T20:20:20.839Z",
      "__v": 0
    }
  ],
  "meta": {
    "page": 1,
    "limit": 10,
    "total": 6,
    "totalPages": 1,
    "hasNext": false,
    "hasPrev": false
  }
}